{php}
switch($this->data['type']) {
    case 'subject':
        {/php}

{******************** TEMAT WIADOMOŚCI BEGIN ********************}
TEMAT
{********************* TEMAT WIADOMOŚCI END *********************}

        {php}
        break;

    ##############################################################

    case 'textBody':
        {/php}


{******************** TREŚĆ TXT BEGIN ********************}
TUTAJ TREŚĆ TXT
{********************* TREŚĆ TXT END *********************}


        {php}
        break;
    ##############################################################
    case 'htmlBody':
        {/php}



{******************** TREŚĆ HTML BEGIN ********************}
TUTAJ TREŚĆ HTML
{********************* TREŚĆ HTML END *********************}




        {php}
        break;
    ##############################################################
    default:
        break;
}
{/php}
